cmsis-svd/cmsis-svd/data/SiliconLabs/Series2/EFM32PG22/EFM32PG22C200F512IM40.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_NS_CFGNS</name>
      <version>1</version>
      <description>SYSCFG_NS_CFGNS Registers</description>
      <baseAddress>0x50078000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCFG</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SW0</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>SW1</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SW2</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>SW3</name>
        <value>55</value>
      </interrupt>
      <registers>
        <register>
          <name>CFGNSTCALIB</name>
          <description>Configure to define the system tick for the M33.</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x01004A37</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>TENMS</name>
              <description>Ten Milliseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>Skew</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOREF</name>
              <description>No Reference</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF</name>
                  <description>Reference clock is implemented</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOREF</name>
                  <description>Reference clock is not implemented</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTNSDATA0</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTNSDATA1</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_NS</name>
      <version>1</version>
      <description>SYSCFG_NS Registers</description>
      <baseAddress>0x5007C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCFG</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SW0</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>SW1</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SW2</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>SW3</name>
        <value>55</value>
      </interrupt>
      <registers>
        <register>
          <name>IF</name>
          <description>Read to get system status.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3303000F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software Interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR1B</name>
              <description>RAM 1-Bit Error Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR2B</name>
              <description>RAM 2-Bit Error Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Write to enable interrupts.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3303000F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR1B</name>
              <description>RAM 1-bit Error Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR2B</name>
              <description>RAM 2-bit Error Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREVHW</name>
          <description>Read to get the hard-wired chip revision.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000C01</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Hardwired Chip Revision Major value  </description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Hardwired Chip Family value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Hardwired Chip Revision Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Read to get the chip revision programmed by feature configuration.</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Chip Revision Major value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Chip Family value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Chip Revision Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGSYSTIC</name>
          <description>Configure the source of the system tick for the M33.</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>SYSTICEXTCLKEN</name>
              <description>SysTick External Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Configure to provide general RAM configuration.</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <resetMask>0x00000021</resetMask>
          <fields>
            <field>
              <name>ADDRFAULTEN</name>
              <description>Invalid Address Bus Fault Response Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMECCERRFAULTEN</name>
              <description>Two bit ECC Error Bus Fault Response Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0RETNCTRL</name>
          <description>Configure to provide general RAM retention configuration.</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RAMRETNCTRL</name>
              <description>DMEM0 blockset retention control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0</name>
                  <description>Power down RAM block 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1</name>
                  <description>Power down RAM block 1</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0ECCADDR</name>
          <description>Read to get status of the DMEM0 ECC error address.</description>
          <addressOffset>0x210</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMEM0ECCADDR</name>
              <description>DMEM0 RAM ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0ECCCTRL</name>
          <description>Configure to set RAM ECC control.</description>
          <addressOffset>0x214</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RAMECCEN</name>
              <description>RAM ECC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMECCEWEN</name>
              <description>RAM ECC Error Writeback Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTDATA0</name>
          <description>Data in this register is passed to the trusted root firmware upon reset.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTDATA1</name>
          <description>Data in this register is passed to the trusted root firmware upon reset.</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTLOCKSTATUS</name>
          <description>This register returns the status of the SE managed locks.</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x011F0107</resetValue>
          <resetMask>0x011F0117</resetMask>
          <fields>
            <field>
              <name>BUSLOCK</name>
              <description>Bus Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGLOCK</name>
              <description>Register Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MFRLOCK</name>
              <description>Manufacture Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROOTMODELOCK</name>
              <description>Root Mode Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROOTDBGLOCK</name>
              <description>Root Debug Lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERDBGLOCK</name>
              <description>User Invasive Debug Lock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERNIDLOCK</name>
              <description>User Non-invasive Debug Lock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERSPIDLOCK</name>
              <description>User Secure Invasive Debug Lock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERSPNIDLOCK</name>
              <description>User Secure Non-invasive Debug Lock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USERDBGAPLOCK</name>
              <description>User Debug Access Port Lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
